//=============================================================================
/*!	@file	eventGetterBase.h

	@brief	イベント取得インターフェース

	@author	ryunosuke ide
	@date	2013.06.30
*/
//=============================================================================


#ifndef __EVENT_GETTER_BASE_H__
#define __EVENT_GETTER_BASE_H__




namespace nk {
namespace system {

//=============================================================================
/*!
						イベント取得インターフェース
*/
//=============================================================================
class EventGetterBase {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
private:
	//-----------------------メソッド------------------------

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			EventGetterBase() {}
	virtual~EventGetterBase() {}
};
	
}	// namespace system
}	// namespace nk




#endif  // __EVENT_GETTER_BASE_H__