//=============================================================================
/*!	@file	eventGetter.h

	@brief	イベント取得

	@author	ryunosuke ide
	@date	2013.06.29
*/
//=============================================================================


#ifndef __EVENT_GETTER_H__
#define __EVENT_GETTER_H__

#include "systemEvent.h"
#include "mouseEvent.h"
#include "keyboardEvent.h"
#include "../thread/autoCriticalSection.h"

namespace nk {
namespace system {

//=============================================================================
/*!
								イベント取得
								シングルトン
*/
//=============================================================================
class EventGetter {
public:
	
	//-----------------------型定義--------------------------


	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		更新
	*/
	//===========================================================================
	void					UpdateEvent( void );

	//===========================================================================
	/*!	@brief		マウスイベント取得
	*/
	//===========================================================================
	const MouseEvent&		GetMouseEvent( void ) const;

	//===========================================================================
	/*!	@brief		キーボードイベント取得
	*/
	//===========================================================================
	const KeyboardEvent& 	GetKeyboardEvent( void ) const;

	//===========================================================================
	/*!	@brief		システムイベント取得
	*/
	//===========================================================================
	const SystemEvent&		GetSystemEvent( void ) const;

	//===========================================================================
	/*!	@brief		インスタンス生成
	*/
	//===========================================================================
	static void				Initialize( void );

	//===========================================================================
	/*!	@brief		インスタンス削除
	*/
	//===========================================================================
	static void				Terminate( void );

	//===========================================================================
	/*!	@brief		インスタンス取得
	*/
	//===========================================================================
	static EventGetter*		GetInstance( void );
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	MouseEvent			m_mouseEvent;		//!< マウスイベント
	KeyboardEvent		m_keyboardEvent;	//!< キーボードイベント
	SystemEvent			m_systemEvent;		//!< システムイベント
	CriticalSection		m_criticalSection;	//!< クリティカルセクション

	static EventGetter*	m_instance;			//!< インスタンス

private:
	//-------------コンストラクタ・デストラクタ--------------
			EventGetter();
	virtual~EventGetter();
};
	
}	// namespace system
	
}	// namespace nk






#endif  // __EVENT_GETTER_H__