//=============================================================================
/*!	@file	keyboardEventGetter.h

	@brief	キーイベント取得

	@author	ryunosuke ide
	@date	2013.06.30
*/
//=============================================================================


#ifndef __KEYBOARD_EVENT_GETTER_H__
#define __KEYBOARD_EVENT_GETTER_H__

#include "keyboardEventGetterBase.h"

namespace nk {
namespace system {

//=============================================================================
/*!
							マウスイベント取得
*/
//=============================================================================
class KeyboardEventGetter: public KeyboardEventGetterBase {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		ボタン押下チェック
	*/
	//===========================================================================
	virtual bool	IsOn( u32 button ) const;

	//===========================================================================
	/*!	@brief		更新
	*/
	//===========================================================================
	virtual void	Update( void );
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	KeyboardEvent				m_event;				//!< イベント格納
public:
	//-------------コンストラクタ・デストラクタ--------------
			KeyboardEventGetter();
	virtual~KeyboardEventGetter();
};
	
}	// namespace system
}	// namespace nk


#endif  // __KEYBOARD_EVENT_GETTER_H__