//=============================================================================
/*!	@file	mouseEventGetter.h

	@brief	マウスイベント取得

	@author	ryunosuke ide
	@date	2013.06.30
*/
//=============================================================================


#ifndef __MOUSE_EVENT_GETTER_H__
#define __MOUSE_EVENT_GETTER_H__

#include "mouseEventGetterBase.h"
#include "../thread/autoCriticalSection.h"

namespace nk {
namespace system {

//=============================================================================
/*!
							マウスイベント取得
*/
//=============================================================================
class MouseEventGetter : public MouseEventGetterBase {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		ボタン押下チェック
	*/
	//===========================================================================
	virtual bool	IsOn( u32 button ) const;

	//===========================================================================
	/*!	@brief		座標取得
	*/
	//===========================================================================
	virtual void	GetPos( u32* x, u32* y ) const;

	//===========================================================================
	/*!	@brief		更新
	*/
	//===========================================================================
	virtual void	Update( void );
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	MouseEvent				m_event;				//!< イベント格納
public:
	//-------------コンストラクタ・デストラクタ--------------
			MouseEventGetter();
	virtual~MouseEventGetter();
};
	
}	// namespace system
}	// namespace nk


#endif  // __MOUSE_EVENT_GETTER_H__