//=============================================================================
/*!	@file	MouseEventGetterBase.h

	@brief	マウスイベント取得

	@author	ryunosuke ide
	@date	2013.06.30
*/
//=============================================================================


#ifndef __MOUSE_EVENT_GETTER_BASE_H__
#define __MOUSE_EVENT_GETTER_BASE_H__

#include "eventGetterBase.h"
#include "mouseEvent.h"

namespace nk {
namespace system {


//=============================================================================
/*!
							マウスイベント取得
*/
//=============================================================================
class MouseEventGetterBase : public EventGetterBase {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		状態取得
		@param		button		MouseEventのイベント定数
	*/
	//===========================================================================
	virtual bool	IsOn( u32 button ) const { return false; }

	//===========================================================================
	/*!	@brief		座標取得
	*/
	//===========================================================================
	virtual void	GetPos( u32* x, u32* y ) const = 0;
	
private:
	//-----------------------メソッド------------------------

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			MouseEventGetterBase() : EventGetterBase() {}
	virtual~MouseEventGetterBase() {}
};
	
}	// namespace system
}	// namespace nk





#endif  // __MOUSE_EVENT_GETTER_BASE_H__