//=============================================================================
/*!	@file	emitterBase.h

	@brief	エミッターインターフェース

	@author	ryunosuke ide
	@date	2013.07.04
*/
//=============================================================================


#ifndef __EMITTER_BASE_H__
#define __EMITTER_BASE_H__

#include "math/vector.h"

namespace game {
namespace battle {

//=============================================================================
/*!
						エミッターインターフェース
*/
//=============================================================================
class EmitterBase {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
	//===========================================================================
	/*!	@brief		位置設定
	*/
	//===========================================================================
	virtual void	SetPos( const nk::math::Vector& pos );

	//===========================================================================
	/*!	@brief		発射方向設定
		@param		direction	発射方向
		@param		tolerance	左右何度まで振り幅をもたせるか(deg 0～180)
		@note		速度はSetVelocityで設定します
	*/
	//===========================================================================
	virtual void	SetDirection( const nk::math::Vector& direction, f32 tolerance = 0.0f );

	//===========================================================================
	/*!	@brief		速度設定
	*/
	//===========================================================================
	virtual void	SetVelocity( f32 velocity );

	//===========================================================================
	/*!	@brief		回転
	*/
	//===========================================================================
	virtual void	SetRotation( const nk::math::Vector& deg );

	//===========================================================================
	/*!	@brief		噴射間隔
	*/
	//===========================================================================
	virtual void	SetEmitInterval( u32 frame );

	//===========================================================================
	/*!	@brief		生存時間設定
	*/
	//===========================================================================
	virtual void	SetLife( u32 frame );

	//===========================================================================
	/*!	@brief		更新
	*/
	//===========================================================================
	virtual void	Update( void );
	
protected:
	//===========================================================================
	/*!	@brief		発射
	*/
	//===========================================================================
	virtual void	Emit( void ) {}
	
protected:
	//----------------------メンバ変数-----------------------
	u32					m_updateCount;		//!< 更新カウンタ
	u32					m_emitInterval;		//!< 発射間隔
	u32					m_life;				//!< 生存時間
	nk::math::Vector	m_pos;				//!< 発射位置
	nk::math::Vector	m_direction;		//!< 発射方向
	f32					m_tolerance;		//!< ふり幅
	f32					m_velocity;			//!< 発射速度
	nk::math::Vector	m_rotation;			//!< 回転量

private:
	void	_Init( void );
	void	_Term( void );

public:
	//-------------コンストラクタ・デストラクタ--------------
			EmitterBase();
	virtual~EmitterBase();
};
	
}	// namespace battle
}	// namespace game






#endif  // __EMITTER_BASE_H__