//=============================================================================
/*!	@file	multicastSender.h

	@brief	ソケット

	@author	ryunosuke ide
	@date	2013.05.11
*/
//=============================================================================

#ifndef __MULTICAST_SENDER_H__
#define __MULTICAST_SENDER_H__

#include "../../include/net/socket.h"



namespace nk {

namespace net {

//=============================================================================
/*!
						マルチキャストセンダー
*/
//=============================================================================
class MulticastSender {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		生成
	*/
	//===========================================================================
	//virtual bool			Create( const char* ipAddress, s32 port );
	virtual	bool			Setup( const Socket& socket );

	//===========================================================================
	/*!	@brief		送信
	*/
	//===========================================================================
	bool					Send( void* packet, u32 packetSize );
	
private:
	//----------------------メンバ変数-----------------------
	Socket					m_socket;
	
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

public:
	//-------------コンストラクタ・デストラクタ--------------
			MulticastSender();
	virtual~MulticastSender();
};
	
}	// namespace net
	
}	// namespace nk

#endif  // __MULTICAST_SENDER_H__
