//=============================================================================
/*!	@file	udpSendCheckThread.h

	@brief	UDP送信確認スレッド

	@author	ryunosuke ide
	@date	2013.05.18
*/
//=============================================================================

#ifndef __UDP_SEND_CHECK_THREAD_H__
#define __UDP_SEND_CHECK_THREAD_H__

#include "socket.h"
#include "../thread/criticalSection.h"
#include "../thread/threadInterface.h"

namespace nk {

namespace net {

//=============================================================================
/*!
							UDP送信確認スレッド
*/
//=============================================================================
class UdpSendCheckThread : public Thread {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		タイムアウト設定
	*/
	//===========================================================================
	void				SetTimeout( u64 nMilliSec );

	//===========================================================================
	/*!	@brief		チェックするソケットの追加
	*/
	//===========================================================================
	void				AddSocket( Socket socket,  );

protected:
	//===========================================================================
	/*!	@brief		スレッド処理
	*/
	//===========================================================================
	virtual void		ThreadFunc( void );
	
private:
	//----------------------メンバ変数-----------------------
	CriticalSection		m_criticalSection;		//!< クリティカルセクション
	
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

public:
	//-------------コンストラクタ・デストラクタ--------------
			UdpSendCheckThread();
	virtual~UdpSendCheckThread();
};
	
}	// namespace net
	
}	// namespace nk








#endif  // __UDP_SEND_CHECK_THREAD_H__