//=============================================================================
/*!	@file	フォント描画

	@brief	フォントレンダラ

	@author	ryunosuke ide
	@date	2013.03.24
*/
//=============================================================================

#ifndef __FONTRENDERER_H__
#define __FONTRENDERER_H__

#include <string>
#include "../graphics/color.h"
#include "../render/renderModel.h"

namespace nk {

namespace graphics {
class Sprite;
}

namespace font {


class	Font;

//=============================================================================
/*!
								フォントレンダラ
*/
//=============================================================================
class FontRenderer {
public:
	//-----------------------型定義--------------------------


	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		フォント登録
	*/
	//===========================================================================
	virtual void	Register( const Font* font );

	//===========================================================================
	/*!	@brief		描画
	*/
	//===========================================================================
	virtual void	Render( s32 screenId, s32 x, s32 y, s32 size, const char* fmt, ... );

	//===========================================================================
	/*!	@brief		描画
	*/
	//===========================================================================
	virtual void	Render( s32 screenId, s32 x, s32 y, s32 size, const Color& color, const char* fmt, ... );

	//===========================================================================
	/*!	@brief		スクリーン設定
	*/
	//===========================================================================
	//virtual void	SetScreenId( s32 screenId );
	
private:
	//----------------------メンバ変数-----------------------
	const Font*				m_font;			//!< フォント
	graphics::Sprite*		m_sprite;		//!< スプライト
	
	
	
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

public:
	//-------------コンストラクタ・デストラクタ--------------
			FontRenderer();
	virtual~FontRenderer();
};
	
}	// namespace font
}	// namespace nk







#endif  // __FONTRENDERER_H__