//=============================================================================
/*!	@file	autoMutex.h

	@brief	ミューテックス

	@author	ryunosuke ide
	@date	2013.03.10
*/
//=============================================================================

#ifndef __AUTO_MUTEX_H__
#define __AUTO_MUTEX_H__

#include "./threadFunc.h"
#include "./mutex.h"

#define SCOPE_MUTEX(mutex)	AutoMutex _automutex(mutex)

namespace nk {

//=============================================================================
/*!
								ミューテックス
*/
//=============================================================================
class AutoMutex {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
private:
	//----------------------メンバ変数-----------------------
	Mutex&			m_mutex;			//!< ミューテックス
	
	//-----------------------メソッド------------------------

public:
	//-------------コンストラクタ・デストラクタ--------------
			AutoMutex( Mutex& mutex );
	virtual~AutoMutex();
	
private:
	AutoMutex();
};

	
}	// namespace nk






#endif  // __AUTO_MUTEX_H__