//=============================================================================
/*!	@file	battleObject.h

	@brief	対戦オブジェクト

	@author	ryunosuke ide
	@date	2013.06.04
*/
//=============================================================================


#ifndef __BATTLE_OBJECT_H__
#define __BATTLE_OBJECT_H__

#include "game/gameObject.h"
#include "system/renderObject.h"
#include "earth/earthObject.h"

namespace game {
namespace battle {

class BattleExecutor;



//=============================================================================
/*!
							対戦オブジェクト
*/
//=============================================================================
class BattleObject : public EarthObject, public GameObject, public RenderObject {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		バトル生成時初期化
	*/
	//===========================================================================
	virtual void				InitializeForBattle( BattleExecutor* battleExec )
	{
		m_battleExec	= battleExec;
	}

	//===========================================================================
	/*!	@brief		バトル消滅時終了処理
	*/
	//===========================================================================
	virtual void				TerminateForBattle( void ) {}

	//===========================================================================
	/*!	@brief		重力移動
	*/
	//===========================================================================
// 	virtual void				FreeFall( void );

	//===========================================================================
	/*!	@brief		位置設定
	*/
	//===========================================================================
// 	void					 	SetPos( const nk::math::Vector& pos );

	//===========================================================================
	/*!	@brief		位置取得
	*/
	//===========================================================================
// 	const nk::math::Vector& 	GetPos( void ) const;

	//===========================================================================
	/*!	@brief		前回位置設定
	*/
	//===========================================================================
 	void					 	SetPrevPos( const nk::math::Vector& pos );

	//===========================================================================
	/*!	@brief		前回位置取得
	*/
	//===========================================================================
 	const nk::math::Vector& 	GetPrevPos( void ) const;
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

protected:
	//----------------------メンバ変数-----------------------
// 	nk::math::Vector		m_nowPos;			//!< 現在位置
	nk::math::Vector		m_prevPos;			//!< 前回位置
	nk::math::Vector		m_direction;		//!< 向いている方向
// 	nk::math::Vector		m_rotation;			//!< 回転量

	BattleExecutor*			m_battleExec;		//!< バトル
	
public:
	//-------------コンストラクタ・デストラクタ--------------
			BattleObject();
	virtual~BattleObject();
};

}	// namespace battle

	
}	// namespace game







#endif  // __BATTLE_OBJECT_H__