//=============================================================================
/*!	@file	normalBattleScene.h

	@brief	通常バトル

	@author	ryunosuke ide
	@date	2013.06.02
*/
//=============================================================================

//-------------------------------インクルード-------------------------------
#include "normalBattleScene.h"


//--------------------------------define定義--------------------------------



//--------------------------------static変数--------------------------------
namespace {

}	// unnamed

//--------------------------------static関数--------------------------------
namespace {

}	// unnamed

//---------------------------------関数定義---------------------------------


namespace game {

//===========================================================================
/*!	@brief	コンストラクタ
	@param	----
*/
//===========================================================================
NormalBattleScene::NormalBattleScene()
{
	_Init();
}


//===========================================================================
/*!	@brief	デストラクタ
	@param	----
*/
//===========================================================================
NormalBattleScene::~NormalBattleScene()
{
	_Term();
}


//===========================================================================
/*!	@brief	初期化
	@param	----
	@return	----
*/
//===========================================================================
void NormalBattleScene::_Init( void )
{

}


//===========================================================================
/*!	@brief	終了処理
	@param	----
	@return	----
*/
//===========================================================================
void NormalBattleScene::_Term( void )
{
	
}


//===========================================================================
/*!	@brief		初期化
	@param		parent	親
	@return		----
*/
//===========================================================================
void NormalBattleScene::InitializeScene( SceneInterface* parent )
{
	BattleScene::InitializeScene( parent );
}


//===========================================================================
/*!	@brief		終了
	@param		parent	親
	@return		----
*/
//===========================================================================
void NormalBattleScene::TerminateScene( SceneInterface* parent )
{
	BattleScene::TerminateScene( parent );
}


//===========================================================================
/*!	@brief		更新
	@param		parentMessage	親からのメッセージ
	@return		子に通知するメッセージ
*/
//===========================================================================
s32 NormalBattleScene::ExecuteLocal( s32 parentMessage )
{
	BattleScene::ExecuteLocal( parentMessage );

	
	return MESSAGE_NONE;
}


//===========================================================================
/*!	@brief		レンダリング
	@param		----
	@return		----
*/
//===========================================================================
void NormalBattleScene::RenderLocal( void )
{
	BattleScene::RenderLocal();
	
	nk::SystemPrint( 0, 0, "Normal Battle" );
		
}


	
}	// namespace game