//=============================================================================
/*!	@file	layoutParser.h

	@brief	レイアウトXMLパーサー

	@author	ryunosuke ide
	@date	2013.06.09
*/
//=============================================================================


#ifndef __LAYOUT_PARSER_H__
#define __LAYOUT_PARSER_H__

#include "../../include/file/xercesParser.h"

namespace nk {

class LayoutPartsBox;
class LayoutParts;

//=============================================================================
/*!
							レイアウトパーサー
*/
//=============================================================================
class LayoutParser {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		解析
	*/
	//===========================================================================
	bool	Parse( const char* path, LayoutPartsBox* root );
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	XercesParser*			m_xercesParser;

public:
	//-------------コンストラクタ・デストラクタ--------------
			LayoutParser();
	virtual~LayoutParser();
};
	
}	// namespace nk





#endif  // __LAYOUT_PARSER_H__