//=============================================================================
/*!	@file	xercesParser.h

	@brief	xercesc parser

	@author	ryunosuke ide
	@date	2013.06.09
*/
//=============================================================================


#ifndef __XERCES_PARSER_H__
#define __XERCES_PARSER_H__

#include "./xercesUtility.h"


namespace nk {

//=============================================================================
/*!
								xercesc parser
*/
//=============================================================================
class XercesParser {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		解析
	*/
	//===========================================================================
	bool					Parse( const char* xmlfile );

	//===========================================================================
	/*!	@brief		ドキュメントを関連付け
	*/
	//===========================================================================
	void					RegisterDocument( xercesc::DOMDocument* doc );

	//===========================================================================
	/*!	@brief		ドキュメント取得
	*/
	//===========================================================================
	xercesc::DOMDocument*	GetDocument( void );

	//===========================================================================
	/*!	@brief		ルート要素を取得
	*/
	//===========================================================================
	xercesc::DOMElement*	GetRootElement( void );

	//===========================================================================
	/*!	@brief		tagNameの名前を持っている子を検索
	*/
	//===========================================================================
	xercesc::DOMNodeList*	GetElementByTagName( xercesc::DOMElement* elemenent, const char* tagName );

	//===========================================================================
	/*!	@brief		初期化済みならtrueを返す
	*/
	//===========================================================================
	bool					Initialized( void ) const;
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	bool							m_initialized;	//!< 初期化済みならtrue
	xercesc::XercesDOMParser*		m_parser;		//!< パーサー
	xercesc::DOMDocument*			m_document;		//!< ドキュメント
	xercesc::DOMElement*			m_elementRoot;	//!< エレメント
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			XercesParser( const char* xmlfile );
			XercesParser();
	virtual~XercesParser();
};
	
}	// namespace nk




#endif  // __XERCES_PARSER_H__