//=============================================================================
/*!	@file	gameObjectManager.h

	@brief	ゲームオブジェクト管理

	@author	ryunosuke ide
	@date	2013.05.20
*/
//=============================================================================

#ifndef __GAME_OBJECT_MANAGER_H__
#define __GAME_OBJECT_MANAGER_H__

#include <vector>
#include "gameObject.h"

namespace game {

//=============================================================================
/*!
							ゲームオブジェクト管理
*/
//=============================================================================
class GameObjectManager {
public:
	//-----------------------型定義--------------------------


	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		更新するオブジェクトを追加
	*/
	//===========================================================================
	void	AddGameObject( GameObject* gameObj );

	//===========================================================================
	/*!	@brief		ゲームオブジェクトを管理外に
	*/
	//===========================================================================
	void	RemoveGameObject( GameObject* gameObj );

	//===========================================================================
	/*!	@brief		削除
	*/
	//===========================================================================
	void	DeleteGameObjects( void );

	//===========================================================================
	/*!	@brief		システムコールバック
	*/
	//===========================================================================
	void	CallbackSystemEvent( nk::Main::SYSTEM_EVENT event );
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	std::vector<GameObject*>		m_gameObjects;		//!< ゲームオブジェクト

public:
	//-------------コンストラクタ・デストラクタ--------------
			GameObjectManager();
	virtual~GameObjectManager();
};
	
}	// namespace game





#endif  // __GAME_OBJECT_MANAGER_H__