//=============================================================================
/*!	@file	sound.h

	@brief	サウンド

	@author	ryunosuke ide
	@date	2013.02.10
*/
//=============================================================================

#ifndef __SOUND_H__
#define __SOUND_H__


#include "../typedef.h"

namespace nk {

namespace sound {




//=============================================================================
/*!
					サウンドインターフェース
*/
//=============================================================================
class Sound {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//! オーディオ登録
	virtual bool		Register( u32 id );

	//! 再生
	virtual bool		Play( void )	= 0;

	//! 停止
	virtual bool		Stop( void )	= 0;
	
private:
	//----------------------メンバ変数-----------------------
	u32					m_soundId;			//!< サウンドID
	
	
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

public:
	//-------------コンストラクタ・デストラクタ--------------
			Sound();
	virtual~Sound();
};
	
}	// namespace sound
	
}	// namespace nk







#endif  // __SOUND_H__