//=============================================================================
/*!	@file	autoTime.h

	@brief	自動時間測定

	@author	ryunosuke ide
	@date	2013.06.22
*/
//=============================================================================

#ifndef __AUTO_TIME_H__
#define __AUTO_TIME_H__

#include "utility.h"

namespace nk {


//=============================================================================
/*!
								時間測定
*/
//=============================================================================
class AutoTime {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	char	m_label[256];
	u64		m_startTime;

public:
	//-------------コンストラクタ・デストラクタ--------------
			AutoTime( const char* m_label = NULL );
	virtual~AutoTime( void );
};

//! label にはダブルクォーテーションをつけない
#define AUTO_TIME( label )	nk::AutoTime __autoTime_##label( #label )
	
}	// namespace nk






#endif  // __AUTO_TIME_H__