//=============================================================================
/*!	@file	buttonEventListener.h

	@brief	ボタン

	@author	ryunosuke ide
	@date	2013.06.07
*/
//=============================================================================


#ifndef __BUTTON_EVENT_LISTENER_H__
#define __BUTTON_EVENT_LISTENER_H__



#include "spriteAnimation.h"


namespace nk {

namespace graphics {

class Button;

//=============================================================================
/*!
							ボタンイベントリスナー
*/
//=============================================================================
class ButtonEventListener {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		入場時
	*/
	//===========================================================================
	virtual void	OnCursorOver( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		退場時
	*/
	//===========================================================================
	virtual void	OnCursorOut( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		押された瞬間(アニメーション開始時)
	*/
	//===========================================================================
	virtual void	OnCursorDownStart( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		押された瞬間(アニメーション終了時)
	*/
	//===========================================================================
	virtual void	OnCursorDownEnd( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		離された瞬間(アニメーション開始時)
	*/
	//===========================================================================
	virtual void	OnCursorUpStart( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		離された瞬間(アニメーション終了時)
	*/
	//===========================================================================
	virtual void	OnCursorUpEnd( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		ホールド時
	*/
	//===========================================================================
	virtual void	OnHold( nk::graphics::Button* eventButton ) {}
	
	//===========================================================================
	/*!	@brief		
	*/
	//===========================================================================
	//virtual void	OnDoubleClick( Button* eventButton ) {}

	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			ButtonEventListener();
	virtual~ButtonEventListener();
};
	
}	// namespace graphics
	
}	// namespace nk


#endif  // __BUTTON_EVENT_LISTENER_H__