//=============================================================================
/*!	@file	layoutEventListener.h

	@brief	レイアウトイベントリスナー

	@author	ryunosuke ide
	@date	2013.06.17
*/
//=============================================================================

#ifndef __LAYOUT_EVENT_LISTENER_H__
#define __LAYOUT_EVENT_LISTENER_H__


namespace nk {
namespace graphics {

class Button;

//=============================================================================
/*!
						レイアウトイベントリスナー
*/
//=============================================================================
class LayoutEventListener {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		入場時
	*/
	//===========================================================================
	virtual void	ButtonOnCursorOver( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		退場時
	*/
	//===========================================================================
	virtual void	ButtonOnCursorOut( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		押された瞬間(アニメーション開始時)
	*/
	//===========================================================================
	virtual void	ButtonOnCursorDownStart( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		押された瞬間(アニメーション終了時)
	*/
	//===========================================================================
	virtual void	ButtonOnCursorDownEnd( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		離された瞬間(アニメーション開始時)
	*/
	//===========================================================================
	virtual void	ButtonOnCursorUpStart( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		離された瞬間(アニメーション終了時)
	*/
	//===========================================================================
	virtual void	ButtonOnCursorUpEnd( nk::graphics::Button* eventButton ) {}

	//===========================================================================
	/*!	@brief		ホールド時
	*/
	//===========================================================================
	virtual void	ButtonOnHold( nk::graphics::Button* eventButton ) {}
	
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			LayoutEventListener();
	virtual~LayoutEventListener();
};
	
}	// namespace graphics
}	// namespace nk




#endif  // __LAYOUT_EVENT_LISTENER_H__