/*-------------------------------------------------------------------------
	説　明：スプライトアニメーションクラス
	作成日：2011/01/23
	更新日：2011/01/23
--------------------------------------------------------------------------*/

#ifndef __SPRITEANIMATION_H__
#define __SPRITEANIMATION_H__

#include "./sprite.h"

namespace nk {
namespace graphics {

	
/*----------------------------------*/
/*	スプライトアニメーションクラス	*/
/*----------------------------------*/
class SpriteAnimation : public Sprite {
public:
	//	初期化
	//---------------------------------------
	void Init();	
	void Init( const char *tex_path, int frame_w, int frame_h, int row, int col, int update_frame, bool loop = false );

	//	コマ数を指定
	//---------------------------------------
	void SetFrame(int row, int col = 1);

	//	再生するアニメーションを設定（画像の左を0として何番目のやつか）
	//---------------------------------------
	void SetPlayAnimation(int num);

	//	更新頻度を設定
	//---------------------------------------
	void SetUpdateFrequency(int frame)
	{
		if( frame < 1 ) { frame = 1; }
		m_update_frequency = frame;
	}
	
	//===========================================================================
	/*!	@brief		再生開始
	*/
	//===========================================================================	
	void	Start( u32 startFrame = 0 );

	//===========================================================================
	/*!	@brief		停止
	*/
	//===========================================================================	
	void	Stop( void );

	//===========================================================================
	/*!	@brief		ポーズ
	*/
	//===========================================================================
	void	Pause( void );

	//===========================================================================
	/*!	@brief		再開
	*/
	//===========================================================================
	void	Resume( void );

	

	//	アニメーションをループさせる
	//---------------------------------------
	void 	SetAnimationLoop( bool flag = true );

	//	更新
	//---------------------------------------
	void 	Update();

	//	終了したか
	//---------------------------------------
	bool 	IsEnd() const { return !m_play; }

	//===========================================================================
	/*!	@brief		行列取得
	*/
	//===========================================================================
	u32		GetRow( void ) const;
	u32		GetCol( void ) const;

private:
	//	データ
	//---------------------------------------
	int			m_play_animation;		// 現在再生中のアニメーション
	int			m_row;					// 縦方向のコマ数
	int			m_col;					// 横方向のコマ数
	int			m_update_frequency;		// 更新頻度
	bool		m_play;					// アニメーション開始フラグ
	bool		m_loop;					// アニメーションループフラグ
	f32			m_width;				//!< 表示幅
	f32			m_height;				//!< 表示高さ
	f32			m_tex_u;				//!< U
	f32			m_tex_v;				//!< V

	int			m_play_cnt;				// 再生カウンタ

public:
	//	コンストラクタ・デストラクタ
	//---------------------------------------
	 SpriteAnimation( const char *tex_path, int frame_w, int frame_h, int row, int col, int update_frame, bool loop = false );
	 SpriteAnimation();
	~SpriteAnimation();

};
	

}	// namespace graphics
}	// namespace nk

#endif  // __SPRITEANIMATION_H__