//=============================================================================
/*!	@file	autoTimeReport.h

	@brief	時間測定

	@author	ryunosuke ide
	@date	2013.03.17
*/
//=============================================================================

#ifndef __AUTOTIMEREPORT_H__
#define __AUTOTIMEREPORT_H__

#include "../utility/utility.h"


namespace nk {


//=============================================================================
/*!
								時間測定
*/
//=============================================================================
class AutoTimeReport {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
	
private:
	//----------------------メンバ変数-----------------------
	s64		m_start;
	char	m_label[256];
	
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

public:
	//-------------コンストラクタ・デストラクタ--------------
			AutoTimeReport();
			AutoTimeReport( const char* label );
	virtual~AutoTimeReport();
};


}	// namespace nk

#endif  // __AUTOTIMEREPORT_H__