//=============================================================================
/*!	@file	debugIventListener.h

	@brief	デバッグイベントリスナー

	@author	ryunosuke ide
	@date	2013.06.15
*/
//=============================================================================


#ifndef __DEBUG_EVENT_LISTENER_H__
#define __DEBUG_EVENT_LISTENER_H__



namespace nk {


namespace debug {


//=============================================================================
/*!
						デバッグイベントリスナー
*/
//=============================================================================
class DebugEventListener {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		左入力
	*/
	//===========================================================================
	virtual void		InputEvent_Left( s32 lineNo, s32& nowNo, char* dispStr, u32 dispStrSize ) {}

	//===========================================================================
	/*!	@brief		右入力
	*/
	//===========================================================================
	virtual void		InputEvent_Right( s32 lineNo, s32& nowNo, char* dispStr, u32 dispStrSize ) {}

	//===========================================================================
	/*!	@brief		決定入力
	*/
	//===========================================================================
	virtual void		InputEvent_Decision( s32 lineNo, s32& nowNo, char* dispStr, u32 dispStrSize ) {}
	
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			DebugEventListener();
	virtual~DebugEventListener();
};
	
}	// namespace debug
	
}	// namespace nk





#endif  // __DEBUG_EVENT_LISTENER_H__