//=============================================================================
/*!	@file	packetSendThread.h

	@brief	パケット送信スレッド

	@author	ryunosuke ide
	@date	2013.05.23
*/
//=============================================================================

#ifndef __PACKET_SEND_THREAD_H__
#define __PACKET_SEND_THREAD_H__

#include "net/socket.h"
#include "thread/thread.h"


//=============================================================================
/*!
						パケット送信スレッド
*/
//=============================================================================
class PacketSendThread : public net::Thread {
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------
	
	
private:
	//-----------------------メソッド------------------------
	void	_Init( void );
	void	_Term( void );

	//----------------------メンバ変数-----------------------
	

public:
	//-------------コンストラクタ・デストラクタ--------------
			PacketSendThread();
	virtual~PacketSendThread();
};


#endif  // __PACKET_SEND_THREAD_H__