//=============================================================================
/*!	@file	MulticastServerSocket.cpp

	@brief	ソケット

	@author	ryunosuke ide
	@date	2013.05.11
*/
//=============================================================================


//-------------------------------インクルード-------------------------------
#include "../../include/net/socket.h"

#if defined(_WIN32)
#include <ws2tcpip.h>
#endif

#include <stdio.h>
#include <fcntl.h>
#include <errno.h>


//--------------------------------define定義--------------------------------



//--------------------------------static変数--------------------------------
namespace {

}	// unnamed

//--------------------------------static関数--------------------------------
namespace {

}	// unnamed

//---------------------------------関数定義---------------------------------

namespace nk {

namespace net {

	
}	// namespace net
	
}	// namespace nk
