//=============================================================================
/*!	@file	renderObject.h

	@brief	レンダリングオブジェクト

	@author	ryunosuke ide
	@date	2013.05.19
*/
//=============================================================================

#ifndef __RENDER_OBJECT_H__
#define __RENDER_OBJECT_H__

#include "render/renderModel.h"

class RenderObjectManager;

//=============================================================================
/*!
					レンダリングオブジェクトインターフェース
*/
//=============================================================================
class RenderObject {
private:
	friend class RenderObjectManager;
	
public:
	//-----------------------型定義--------------------------
	

	//----------------------静的メンバ-----------------------
	
	
	//-----------------------メソッド------------------------

	//===========================================================================
	/*!	@brief		描画
	*/
	//===========================================================================
	virtual void	Render( void ) = 0;

	//===========================================================================
	/*!	@brief		描画オブジェクトの追加
	*/
	//===========================================================================
	void			RegisterToRenderManager( void );
// 	void			PushRenderObject( void );

	//===========================================================================
	/*!	@brief		描画管理から削除
	*/
	//===========================================================================
	void			RemoveFromRenderManager( void );

protected:

private:
	//-----------------------メソッド------------------------
	void	_Init();
	void	_Term();

	//----------------------メンバ変数-----------------------
	
	static RenderObjectManager*		renderObjectManager;

public:
	//-------------コンストラクタ・デストラクタ--------------
			RenderObject();
	virtual~RenderObject();
};





#endif  // __RENDER_OBJECT_H__